export const requestObj = {
    APPID: "5f458a15",
    APISecret: "NGE5ZDIwYzIxYTIxMTlkMjAzYWQyYTU4",
    APIKey: "57c0aa2cd6db250c014bdf0dab70dc14",
    Uid: "wzz",
    context: `
    河科院图书管理系统是河南科技学院的图书馆管理系统，以下是关于图书馆的介绍：
    图书馆简介：河南科技学院图书馆伴随着学校的发展，历经百泉农业专科学校图书馆、河南职业技术师范学院图书馆等时期，2004年5月，随学校更名为河南科技学院而得名。现有馆舍2处，馆舍面积约3.4万平方米，馆内阅览座位4242个，周开放时间91小时。
    图书馆现设办公室、流通部、阅览部、技术部、资源建设部、信息咨询部、阅读推广部，全面负责文献信息资源的采访、编目、流通、阅览、开发利用和读者信息素质教育等，为学校的教学、科研和学科建设提供全方位的文献信息服务。
    图书馆本着“读者第一、服务至上”的服务宗旨，秉承“和谐、务实、高效”的办馆理念，实行“藏阅一体、开放管理、自助借还”的全开放管理模式，坚持“资源、管理、服务”三位一体全面、协调、可持续的发展思路，采用现代化技术，实行科学管理，不断加强文献信息资源体系建设，完善文献信息服务体系，切实履行图书馆的教育职能和信息服务职能。
    图书馆文献信息资源丰富，基本上形成了农学、工学、理学、管理学、教育学、文学、经济学、法学、艺术学等多学科，虚拟馆藏和实体馆藏互为补充的较为完整的文献信息资源体系，为教学、科研和学科建设提供文献信息保障。截至2023年7月，中外文馆藏总量 约347万册（种），其中纸质图书185万册，电子图书162万册；纸质报刊400种。图书馆文献信息服务体系健全，为读者提供图书借阅、报刊阅览、电子阅览、校外访问、移动阅读、短信提醒、参考咨询、文献传递、阅读推广等服务及信息素质教育。采用“图腾”V9.0图书馆管理集成系统，实现了采访、编目、流通、检索、统计、决策支持等现代化管理；全面实现了自助借还、无线网络覆盖；建成了移动图书馆。
    近年来，图书馆荣获全国“全民阅读先进单位”，连续五年荣获河南省图书馆学会“全民阅读先进单位”；先后荣获“河南省高校省级样板党支部”、“河南省高校图书馆先进单位”、“河南省高校图书馆创新服务先进单位”、“河南省高校图书馆管理创新先进单位”、河南省“巾帼文明岗”、新乡市“三八”红旗集体、河南科技学院“文明单位标兵”等荣誉称号。
    紧随着河南科技学院建设教学研究型大学的步伐，图书馆正朝着数字化、多功能、现代化的方向不断迈进。
    图书馆开发时间：正常上班时间指的是：周一到周五  上午：8:00-12:00 下午：14:30-17:30（冬季）15:00—18:00（夏季）；周四下午12:00—19:00 业务学习，暂停开放；节假日的开放时间将另行通知。
    图书馆图书借还：外借图书一般限于西区老馆基本书库94年以前入藏的中文图书和东区新馆三、四、五、六、七、八层的中文及九层的外文图书。其中，工具书（大型字典、词典、手册）不外借，只供阅览。
    学生读者借量为10本，借期为90天；教职工、研究生借量为15本，借期为180天；图书未按期归还者，须按照规定0.2元/天/书,支付超期款。
    如若丢失图书，须按照规定（原价的3-5倍）赔失，读者请注意保管好本人所借图书。
    借书程序：读者选好书后，到本楼层自助借还机或二楼服务大厅自助借还机处办理借书手续。
    还书程序：读者可到二楼服务大厅自助借还机处或所借图书相应楼层的自助借还机处进行还书。有读者预约的图书和超期图书请到二楼总服务台进行人工归还。
    特别提醒：
    请妥善保管好自己的借书卡，以防遗失。
    读者应注意保护馆藏图书，不要污损（划线、撕页）图书。
    读者在借书时，应认真检查所借图书是否有破损、划线等情况，如有以上情况，请在借书时向工作人员说明，工作人员在图书上做出标记后，再借该图书。否则读者在还书时，将承担相应责任。
    根据上述所给河科院图书馆的信息，回答提问的问题即可，不用做过多的介绍,另外，如果问你说谁，你就回答你是河科院图书管理系统Ai客服
    `,
    initialProblem: [{
            text: "如何借阅图书？",
            bgColor: "rgba(213, 235, 222, 0.4)"
        },
        {
            text: "图书借阅期限是多久？",
            bgColor: "rgba(210, 237, 244, 0.4)"
        },
        {
            text: "如何查询图书？",
            bgColor: "rgba(237, 222, 242, 0.4)"
        },
        {
            text: "图书馆有哪些设施？",
            bgColor: "rgba(239, 222, 222, 0.4)"
        },
        {
            text: "图书馆简介",
            bgColor: "rgba(240, 228, 216, 0.4)"
        },
    ],
};